In [1]:
import pandas as pd
import numpy as np

## Handling Missing Data

In [7]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [13]:
float_data.isna() # shows values as True which are null.

0    False
1    False
2     True
3    False
dtype: bool

In [19]:
# NA: it refers to all data which can be either exists or not. If it exists it can be a data that is not observed through problems with data collection, for example.

In [21]:
string_data = pd.Series(["Doğukan", np.nan, "Atakan", None, "Hazal Asu"])
string_data

0      Doğukan
1          NaN
2       Atakan
3         None
4    Hazal Asu
dtype: object

In [26]:
string_data.isna()

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [28]:
float_data = pd.Series([1, 2, None], dtype="float64")
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [30]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [36]:
float_data.dropna() # filtering the data from NA values.

0    1.0
1    2.0
dtype: float64

In [40]:
float_data.fillna(7) # filling the values in the data which are potentially NA with certain value or interpolation methods such as ffill or bfill.

0    1.0
1    2.0
2    7.0
dtype: float64

In [44]:
float_data.notna() # it is reverse of the isna

0     True
1     True
2    False
dtype: bool

### Filtering Out Missing Data

In [47]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [49]:
data[data.notna()] # the same than above

0    1.0
2    3.5
4    7.0
dtype: float64

In [51]:
data = pd.DataFrame([
    [1, 6.5, 3],
    [1, np.nan, np.nan],
    [np.nan, np.nan, np.nan],
    [np.nan, 6.5, 3]
])

data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [53]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [57]:
data.dropna(how="all") # drops only rows that are all NA.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [59]:
# these functions return objects by default and do not modify the contents of the original one.

In [61]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [63]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [65]:
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [71]:
data.dropna(axis=1, how="all") # the same than above

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [73]:
df = pd.DataFrame(np.random.standard_normal((7,3)))
df

          0         1         2
0  0.525611  0.680207 -0.818290
1 -0.200333  1.598488  0.715756
2  0.422371  1.925906  0.903946
3  2.271925  0.041026  0.100467
4 -0.650399  1.333790 -0.983352
5  0.142116  0.459693  1.023627
6 -0.751918  0.419458  0.413274

In [75]:
df.iloc[:4, 1] = np.nan

In [77]:
df

          0         1         2
0  0.525611       NaN -0.818290
1 -0.200333       NaN  0.715756
2  0.422371       NaN  0.903946
3  2.271925       NaN  0.100467
4 -0.650399  1.333790 -0.983352
5  0.142116  0.459693  1.023627
6 -0.751918  0.419458  0.413274

In [79]:
df.iloc[:2, 2] = np.nan
df

          0         1         2
0  0.525611       NaN       NaN
1 -0.200333       NaN       NaN
2  0.422371       NaN  0.903946
3  2.271925       NaN  0.100467
4 -0.650399  1.333790 -0.983352
5  0.142116  0.459693  1.023627
6 -0.751918  0.419458  0.413274

In [81]:
df.dropna()

          0         1         2
4 -0.650399  1.333790 -0.983352
5  0.142116  0.459693  1.023627
6 -0.751918  0.419458  0.413274

In [91]:
df.dropna(thresh=2) # you can arrange a thresh in order for dropping.

          0         1         2
2  0.422371       NaN  0.903946
3  2.271925       NaN  0.100467
4 -0.650399  1.333790 -0.983352
5  0.142116  0.459693  1.023627
6 -0.751918  0.419458  0.413274

### Filling In Missing Data

In [94]:
df

          0         1         2
0  0.525611       NaN       NaN
1 -0.200333       NaN       NaN
2  0.422371       NaN  0.903946
3  2.271925       NaN  0.100467
4 -0.650399  1.333790 -0.983352
5  0.142116  0.459693  1.023627
6 -0.751918  0.419458  0.413274

In [96]:
df.fillna(0)

          0         1         2
0  0.525611  0.000000  0.000000
1 -0.200333  0.000000  0.000000
2  0.422371  0.000000  0.903946
3  2.271925  0.000000  0.100467
4 -0.650399  1.333790 -0.983352
5  0.142116  0.459693  1.023627
6 -0.751918  0.419458  0.413274

In [100]:
df.fillna({1: 0.5, 2:0}) # calling fillna with a dictionary, you can use a different fill value for each column.

          0         1         2
0  0.525611  0.500000  0.000000
1 -0.200333  0.500000  0.000000
2  0.422371  0.500000  0.903946
3  2.271925  0.500000  0.100467
4 -0.650399  1.333790 -0.983352
5  0.142116  0.459693  1.023627
6 -0.751918  0.419458  0.413274

In [112]:
df2 = pd.DataFrame(np.random.standard_normal((6,3)))
df2

          0         1         2
0 -1.085252  0.884445  1.310760
1 -0.106257 -1.171666 -0.209822
2  1.140707  0.222734  1.496263
3 -1.386083 -0.406213 -1.915971
4 -1.215996 -0.075485 -1.433359
5  0.318786 -0.351699  0.129902

In [114]:
df2.iloc[2:, 1] = np.nan

In [116]:
df2.iloc[4:, 2] = np.nan

In [118]:
df2

          0         1         2
0 -1.085252  0.884445  1.310760
1 -0.106257 -1.171666 -0.209822
2  1.140707       NaN  1.496263
3 -1.386083       NaN -1.915971
4 -1.215996       NaN       NaN
5  0.318786       NaN       NaN

In [124]:
df2.ffill() # using interpolation method

          0         1         2
0 -1.085252  0.884445  1.310760
1 -0.106257 -1.171666 -0.209822
2  1.140707 -1.171666  1.496263
3 -1.386083 -1.171666 -1.915971
4 -1.215996 -1.171666 -1.915971
5  0.318786 -1.171666 -1.915971

In [154]:
df2

          0         1         2         3         4         5
0 -1.085252 -0.106257  1.140707 -1.386083 -1.215996  0.318786
1  0.884445 -1.171666       NaN       NaN       NaN       NaN
2  1.310760 -0.209822  1.496263 -1.915971       NaN       NaN
7  7.000000  7.000000  7.000000  7.000000  7.000000  7.000000

In [156]:
df2.T

          0         1         2    7
0 -1.085252  0.884445  1.310760  7.0
1 -0.106257 -1.171666 -0.209822  7.0
2  1.140707       NaN  1.496263  7.0
3 -1.386083       NaN -1.915971  7.0
4 -1.215996       NaN       NaN  7.0
5  0.318786       NaN       NaN  7.0

In [158]:
df2[7] = 7
df2

          0         1         2         3         4         5  7
0 -1.085252 -0.106257  1.140707 -1.386083 -1.215996  0.318786  7
1  0.884445 -1.171666       NaN       NaN       NaN       NaN  7
2  1.310760 -0.209822  1.496263 -1.915971       NaN       NaN  7
7  7.000000  7.000000  7.000000  7.000000  7.000000  7.000000  7

In [160]:
df2 = df2.T

In [162]:
df2.T

          0         1         2         3         4         5    7
0 -1.085252 -0.106257  1.140707 -1.386083 -1.215996  0.318786  7.0
1  0.884445 -1.171666       NaN       NaN       NaN       NaN  7.0
2  1.310760 -0.209822  1.496263 -1.915971       NaN       NaN  7.0
7  7.000000  7.000000  7.000000  7.000000  7.000000  7.000000  7.0

In [164]:
df2.bfill()

          0         1         2    7
0 -1.085252  0.884445  1.310760  7.0
1 -0.106257 -1.171666 -0.209822  7.0
2  1.140707  7.000000  1.496263  7.0
3 -1.386083  7.000000 -1.915971  7.0
4 -1.215996  7.000000  7.000000  7.0
5  0.318786  7.000000  7.000000  7.0
7  7.000000  7.000000  7.000000  7.0

In [166]:
df2

          0         1         2    7
0 -1.085252  0.884445  1.310760  7.0
1 -0.106257 -1.171666 -0.209822  7.0
2  1.140707       NaN  1.496263  7.0
3 -1.386083       NaN -1.915971  7.0
4 -1.215996       NaN       NaN  7.0
5  0.318786       NaN       NaN  7.0
7  7.000000  7.000000  7.000000  7.0

In [172]:
df2.ffill(limit=2) # constraining the number of value for interpolation.

          0         1         2    7
0 -1.085252  0.884445  1.310760  7.0
1 -0.106257 -1.171666 -0.209822  7.0
2  1.140707 -1.171666  1.496263  7.0
3 -1.386083 -1.171666 -1.915971  7.0
4 -1.215996       NaN -1.915971  7.0
5  0.318786       NaN -1.915971  7.0
7  7.000000  7.000000  7.000000  7.0

In [174]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [176]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [180]:
data.fillna(data.median())

0    1.0
1    3.5
2    3.5
3    3.5
4    7.0
dtype: float64

In [183]:
# fillna function arguments: value, method, axis, limit

## Data Transformation

### Removing duplicates

In [5]:
data = pd.DataFrame(
    {
        "k1": ["one", "two"] * 3 + ["two"],
        "k2": [1, 1, 2, 3, 3, 4, 4]
    })

data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [7]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [9]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [11]:
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [17]:
data.drop_duplicates(subset=["k1"]) # specifying a subset to detect duplicates according to k1 column.In other words, filtering based on k1 column.

    k1  k2  v1
0  one   1   0
1  two   1   1

In [21]:
data.drop_duplicates(["k1", "k2"], keep="last") 
# by default these methods keep the first observed value but when we specify keep as last then the last observed value will be keeped.

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [24]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
  "pastrami", "corned beef", "bacon",
  "pastrami", "honey ham", "nova lox"],
  "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [28]:
meat_to_animal = {
 "bacon": "pig",
 "pulled pork": "pig",
 "pastrami": "cow",
 "corned beef": "cow",
 "honey ham": "pig",
 "nova lox": "salmon"
}

In [30]:
data["animal"] = data["food"].map(meat_to_animal)

In [32]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [34]:
def get_animal(x):
    return meat_to_animal[x]

In [36]:
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [38]:
# so, using map is a convenient way to perform element-wise transformations and other data cleaning-related operations.

### Replacing Values

In [41]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [43]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [45]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [47]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [49]:
data.replace({-999: np.nan, -1000: 0}) # ther argument passed can also be a dictionary.

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [51]:
# NOTE: The data.replace method is distinct from data.str.replace (performs element-wise string substitution)

### Renaming Axis Indexes

In [54]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
 index=["Ohio", "Colorado", "New York"],
 columns=["one", "two", "three", "four"])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [56]:
def transform(x):
    return x[:4].upper()

In [58]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [62]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [70]:
data.rename(index=str.title, columns=str.upper) 
# if you want to create a transformed version of a data set without modifying the original, use rename method.

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [76]:
data.rename(index={"OHIO": "INDIANA"}, columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [78]:
# rename saves you from the chore of copying the DataFrame manually and assigning new values to its index and columns attributes.

### Discretization and Binning

In [81]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [83]:
bins = [18, 25, 35, 60, 100]

In [85]:
age_categories = pd.cut(ages, bins)
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [87]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [89]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [93]:
age_categories.categories[0]

Interval(18, 25, closed='right')

In [97]:
# pd.value_counts(age_categories) deprecated. Instead use this:
pd.Series(age_categories).value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [99]:
pd.cut(ages, bins, right=False) # changing the which side is closed by passing right argument)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [103]:
group_names = ["Youth", "Young Adult", "Middle Aged", "Senior"]
pd.cut(ages, bins, labels=group_names) # overriding the default interval-based bin labeling with labels option

['Youth', 'Youth', 'Youth', 'Young Adult', 'Youth', ..., 'Young Adult', 'Senior', 'Middle Aged', 'Middle Aged', 'Young Adult']
Length: 12
Categories (4, object): ['Youth' < 'Young Adult' < 'Middle Aged' < 'Senior']

In [107]:
pd.Series(pd.cut(ages, bins, labels=group_names)).value_counts()

Youth          5
Young Adult    3
Middle Aged    3
Senior         1
Name: count, dtype: int64

In [111]:
data = np.random.uniform(size=20)
pd.cut(data, 4, precision=2)

[(0.75, 0.99], (0.022, 0.26], (0.022, 0.26], (0.022, 0.26], (0.022, 0.26], ..., (0.26, 0.51], (0.75, 0.99], (0.75, 0.99], (0.022, 0.26], (0.022, 0.26]]
Length: 20
Categories (4, interval[float64, right]): [(0.022, 0.26] < (0.26, 0.51] < (0.51, 0.75] < (0.75, 0.99]]

In [113]:
data = np.random.standard_normal(1000)
quartiles = pd.qcut(data, 4, precision=2)
quartiles

[(-0.0019, 0.66], (-0.0019, 0.66], (-0.0019, 0.66], (-0.68, -0.0019], (-3.4699999999999998, -0.68], ..., (-0.0019, 0.66], (-3.4699999999999998, -0.68], (0.66, 3.41], (0.66, 3.41], (-3.4699999999999998, -0.68]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.4699999999999998, -0.68] < (-0.68, -0.0019] < (-0.0019, 0.66] < (0.66, 3.41]]

In [123]:
pd.Series(quartiles).value_counts()

(-3.4699999999999998, -0.68]    250
(-0.68, -0.0019]                250
(-0.0019, 0.66]                 250
(0.66, 3.41]                    250
Name: count, dtype: int64

In [127]:
pd.Series(pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])).value_counts()

(-1.295, -0.00192]               400
(-0.00192, 1.257]                400
(-3.4579999999999997, -1.295]    100
(1.257, 3.409]                   100
Name: count, dtype: int64

### Detecting and Filtering Outliers

In [132]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.007948    -0.014957     0.014719     0.028628
std       0.990143     0.995034     1.013151     0.994594
min      -3.878755    -3.255783    -3.416912    -2.945733
25%      -0.660099    -0.671230    -0.704577    -0.679818
50%      -0.029460     0.014409    -0.021331     0.006100
75%       0.649412     0.668270     0.693509     0.696502
max       3.146814     2.709423     3.845986     3.305860

In [134]:
col = data[2]

In [136]:
col[col.abs() > 3]

238   -3.416912
295    3.845986
534    3.121933
868    3.635794
986   -3.052224
Name: 2, dtype: float64

In [138]:
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
203  3.146814  0.918391 -1.462497  1.983146
238  2.127100  0.696220 -3.416912 -0.049233
295  0.742998  2.255893  3.845986  1.186244
303  3.062045  2.048440 -1.180332  0.866293
440 -0.983156  0.301555 -0.185524  3.220170
534 -0.945998 -1.582683  3.121933 -1.155179
611 -3.878755  0.403537 -1.695540 -1.141771
740 -1.276136 -0.995661  0.203586  3.305860
868  0.351636  0.868992  3.635794 -0.800152
878  3.061775  0.434298  0.827499  0.427117
975  0.563791 -3.255783  0.015690 -0.081999
986  0.401768 -0.017426 -3.052224 -0.257455

In [140]:
data[data.abs() > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.008556    -0.014702     0.013584     0.028102
std       0.986240     0.994232     1.006352     0.992948
min      -3.000000    -3.000000    -3.000000    -2.945733
25%      -0.660099    -0.671230    -0.704577    -0.679818
50%      -0.029460     0.014409    -0.021331     0.006100
75%       0.649412     0.668270     0.693509     0.696502
max       3.000000     2.709423     3.000000     3.000000

In [142]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0  1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0 -1.0  1.0
3 -1.0 -1.0  1.0  1.0
4  1.0 -1.0  1.0  1.0

### Permutation and Random Sampling

In [147]:
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [175]:
sampler = np.random.permutation(5)
sampler

array([4, 1, 0, 3, 2])

In [171]:
df.take(sampler)

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6
2  14  15  16  17  18  19  20

In [177]:
df.iloc[sampler]

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13
0   0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
2  14  15  16  17  18  19  20

In [190]:
column_sampler = np.random.permutation(7)
column_sampler

array([5, 4, 0, 3, 1, 2, 6])

In [192]:
df.take(column_sampler, axis="columns")

    5   4   0   3   1   2   6
0   5   4   0   3   1   2   6
1  12  11   7  10   8   9  13
2  19  18  14  17  15  16  20
3  26  25  21  24  22  23  27
4  33  32  28  31  29  30  34

In [202]:
df.sample(n=3)

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
3  21  22  23  24  25  26  27
2  14  15  16  17  18  19  20

In [208]:
choices = pd.Series([5, 7, -1, 6, 4])
choices.sample(n=10, replace=True)

1    7
0    5
4    4
4    4
0    5
4    4
0    5
3    6
4    4
0    5
dtype: int64

### Computing Indicator/Dummy Variables

In [11]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"], "data1": range(6)})

In [13]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [7]:
pd.get_dummies(df["key"])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [15]:
dummies = pd.get_dummies(df["key"], prefix="key")
df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0  False   True  False
1      1  False   True  False
2      2   True  False  False
3      3  False  False   True
4      4   True  False  False
5      5  False   True  False

In [21]:
np.random.seed(12345) # to make the example repeatable

In [23]:
values = np.random.uniform(size=10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [25]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False       False       False       False        True
1       False        True       False       False       False
2        True       False       False       False       False
3       False        True       False       False       False
4       False       False        True       False       False
5       False       False        True       False       False
6       False       False       False       False        True
7       False       False       False        True       False
8       False       False       False        True       False
9       False       False       False        True       False

## Extension Data Types

In [5]:
s = pd.Series([1, 2, 3, None])
s

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [7]:
s.dtype

dtype('float64')

In [9]:
s = pd.Series([1, 2, 3, None], dtype=pd.Int64Dtype())
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [11]:
s.isna()

0    False
1    False
2    False
3     True
dtype: bool

In [13]:
s.dtype

Int64Dtype()

In [15]:
s[3]

In [17]:
s[3] is pd.NA

True

In [21]:
s = pd.Series([1, 2, 3, None], dtype="Int64")
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [23]:
s = pd.Series(['one', 'two', None, 'three'], dtype=pd.StringDtype())
s

0      one
1      two
2     <NA>
3    three
dtype: string

In [25]:
df = pd.DataFrame({"A": [1, 2, None, 4],
 "B": ["one", "two", "three", None],
 "C": [False, None, False, True]})

df

     A      B      C
0  1.0    one  False
1  2.0    two   None
2  NaN  three  False
3  4.0   None   True

In [27]:
df["A"] = df["A"].astype("Int64")

In [29]:
df["B"] = df["B"].astype("string")

In [31]:
df["C"] = df["C"].astype("boolean")

In [33]:
df

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

## String Manipulation

### Python Built-In String Object Methods

In [44]:
val = "  a,b, guido"
val

'  a,b, guido'

In [46]:
val.split(",")

['  a', 'b', ' guido']

In [48]:
pieces = [x.strip() for x in val.split(",")] # split is often combined with strip to trim whitespace (including line breaks)
pieces

['a', 'b', 'guido']

In [50]:
first, second, third = pieces

In [56]:
first + "::" + second + "::" + third # this is not a efficient way to do this, instead use join method like below

'a::b::guido'

In [58]:
"::".join(pieces) # this is much more Pythonic way

'a::b::guido'

In [78]:
# other methods are concerned with locating substrings. Such as: in (the best way to detect a substring), index, find

In [80]:
"guido" in val

True

In [82]:
val.index(",") # if a string cannot be found, then index method would raise an error unlike find method

3

In [84]:
val.find(":") # minus 1 means there is no presence of this value.

-1

In [86]:
val.count(",") # count method will return the number of occurences of a particular substring

2

In [90]:
val.replace("::", ",") # replace is used to substitute occurences of one pattern for another

'  a,b, guido'

In [94]:
val.replace(",", "") # it is commonly used to delete patterns by passing an empty string

'  ab guido'

Python's common built-in string methods: count, endswith, startswith, join, index, find, rfind, replace, strip, rstrip, lstrip, split, lower, upper, casefold, ljust, rjust

### Regular Expressions

In [97]:
import re

In [99]:
text = "foo   bar\t baz \tqux"

In [109]:
text

'foo   bar\t baz \tqux'

In [101]:
re.split(r"\s+", text)

['foo', 'bar', 'baz', 'qux']

In [111]:
regex = re.compile(r"\s+") # using re.compile is highly recommended if you intend to apply the same expression to many strings.

In [113]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [115]:
regex.findall(text)

['   ', '\t ', ' \t']

In [117]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

In [119]:
# re.IGNORECASE makes the regex case insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [121]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [123]:
# match and search methods are closely related to findall.
# findall returns all matches in a string,
# search returns only the first match,
# match only matches at the beginning of the string more rigidly.

In [129]:
m = regex.search(text) # search returns a special match object for the first email address in the text
m # for the preceding regex, the match object can only tell us the start and end position of the pattern in the string

In [131]:
text[m.start():m.end()]

'dave@google.com'

In [139]:
print(regex.match(text)) # returns None, because it will match only if the pattern occurs at the start of the string.

None

In [145]:
print(regex.sub("BASARAN", text)) # sub will return a new string with occurences of the pattern replaced by a new string.

Dave BASARAN
Steve BASARAN
Rob BASARAN
Ryan BASARAN

In [151]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})" # suppose you wanted to find email addresses and 
# at the same time separate each address into its three components (username, domain name, and domain suffix)

In [153]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [155]:
m = regex.match("wesm@bright.net")
m.groups()

('wesm', 'bright', 'net')

In [159]:
d = regex.match("dogukanbasarann@hotmail.com") # a match object produced by this regex returns a tuple of the pattern components with its groups method.
d.groups()

('dogukanbasarann', 'hotmail', 'com')

In [161]:
regex.findall(text) # findall returns a list of tuples when the pattern has groups.

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [163]:
print(regex.sub(r"Username: \1, Domain: \2, Suffix: \3", text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### String Functions in pandas

In [166]:
data = {"Dave": "dave@google.com", "Steve": "steve@gmail.com", "Rob": "rob@gmail.com", "Wes": np.nan}
data = pd.Series(data)

In [168]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [170]:
data.isna()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [172]:
data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [174]:
data_as_string_ext = data.astype('string')
data_as_string_ext

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                 <NA>
dtype: string

In [176]:
data_as_string_ext.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes       <NA>
dtype: boolean

In [178]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"

In [182]:
data.str.findall(pattern, flags=re.IGNORECASE) # you can use regEx with any re options like IGNORECASE

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [184]:
matches = data.str.findall(pattern, flags=re.IGNORECASE).str[0]
matches

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [186]:
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [188]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [192]:
data.str.extract(pattern, flags=re.IGNORECASE) # will return the captured groups of regular expression as a DataFrame

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

In [194]:
# There are a lot of pandas string methods. You should check them later.

## Categorical Data

### Background and Motivation

In [4]:
values = pd.Series(["apple", "orange", "apple", "apple"] * 2)
values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [6]:
pd.unique(values)

array(['apple', 'orange'], dtype=object)

In [18]:
pd.Series(values).value_counts()

0    6
1    2
Name: count, dtype: int64

In [20]:
values = pd.Series([0, 1, 0, 0] * 2)
dim = pd.Series(["apple", "orange"])
values

0    0
1    1
2    0
3    0
4    0
5    1
6    0
7    0
dtype: int64

In [22]:
dim

0     apple
1    orange
dtype: object

In [24]:
dim.take(values) # use the take method to restore the original Series of strings

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

In [26]:
# this representation as integers is called "the categorical or dictionary-encoded representation"

In [30]:
# the array of distinct values can be called the categories, dictionary, or levels of the data

In [32]:
# the integer values that reference the categories are called "the category codes or simply codes"

### Categorical Extension Type in pandas

In [55]:
fruits = ["apple", "orange", "apple", "apple"] * 2

In [57]:
N = len(fruits)

In [59]:
rng = np.random.default_rng(seed=12345)

In [61]:
df = pd.DataFrame({
    "fruit": fruits,
    "basket_id": np.arange(N),
    "count": rng.integers(3, 15, size=N),
    "weight": rng.uniform(0, 4, size=N)
}, columns=["basket_id", "fruit", "count", "weight"])

df

   basket_id   fruit  count    weight
0          0   apple     11  1.564438
1          1  orange      5  1.331256
2          2   apple     12  2.393235
3          3   apple      6  0.746937
4          4   apple      5  2.691024
5          5  orange     12  3.767211
6          6   apple     10  0.992983
7          7   apple     11  3.795525

In [63]:
df["fruit"]

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: object

In [67]:
fruit_cat = df["fruit"].astype("category") # to convert it to categorical
fruit_cat

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [73]:
c = fruit_cat.array
type(c)

pandas.core.arrays.categorical.Categorical

In [75]:
c.categories

Index(['apple', 'orange'], dtype='object')

In [77]:
c.codes

array([0, 1, 0, 0, 0, 1, 0, 0], dtype=int8)

In [79]:
dict(enumerate(c.categories))

{0: 'apple', 1: 'orange'}

In [81]:
df["fruit"] = df["fruit"].astype("category")

In [83]:
df["fruit"]

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [85]:
my_categories = pd.Categorical(["foo", "bar", "baz", "foo", "bar"])
my_categories

['foo', 'bar', 'baz', 'foo', 'bar']
Categories (3, object): ['bar', 'baz', 'foo']

In [87]:
categories = ["foo", "bar", "baz"]
codes = [0, 1, 2, 0, 0, 1]
my_cats_2 = pd.Categorical.from_codes(codes, categories)
my_cats_2

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo', 'bar', 'baz']

In [91]:
ordered_cat = pd.Categorical.from_codes(codes, categories, ordered=True)
ordered_cat # the output indicates that "foo" precdes "bar" in the ordering and so on.

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [93]:
# an unordered categorical instance can be made ordered with as_ordered

In [95]:
my_cats_2.as_ordered()

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [97]:
# as a last note, categorical data need not be strings, it can consist of any immutable value types.

### Computations with Categoricals

In [100]:
rng = np.random.default_rng(seed=12345)
draws = rng.standard_normal(1000)
draws[:5]

array([-1.42382504,  1.26372846, -0.87066174, -0.25917323, -0.07534331])

In [102]:
bins = pd.qcut(draws, 4)
bins

[(-3.121, -0.675], (0.687, 3.211], (-3.121, -0.675], (-0.675, 0.0134], (-0.675, 0.0134], ..., (0.0134, 0.687], (0.0134, 0.687], (-0.675, 0.0134], (0.0134, 0.687], (-0.675, 0.0134]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.121, -0.675] < (-0.675, 0.0134] < (0.0134, 0.687] < (0.687, 3.211]]

In [104]:
bins = pd.qcut(draws, 4, labels=["Q1", "Q2", "Q3", "Q4"])
bins

['Q1', 'Q4', 'Q1', 'Q2', 'Q2', ..., 'Q3', 'Q3', 'Q2', 'Q3', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [106]:
bins.codes[:10]

array([0, 3, 0, 1, 1, 0, 0, 2, 2, 0], dtype=int8)

In [110]:
bins = pd.Series(bins, name="quartile")
results = (pd.Series(draws)
           .groupby(bins)
           .agg(["count", "min", "max"])
           .reset_index())
results

C:\Users\doguk\AppData\Local\Temp\ipykernel_7768\2712999052.py:3: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  .groupby(bins)

  quartile  count       min       max
0       Q1    250 -3.119609 -0.678494
1       Q2    250 -0.673305  0.008009
2       Q3    250  0.018753  0.686183
3       Q4    250  0.688282  3.211418

In [112]:
results["quartile"]

0    Q1
1    Q2
2    Q3
3    Q4
Name: quartile, dtype: category
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

#### better performance with categoricals

In [115]:
N = 10_000_000

In [117]:
labels = pd.Series(["foo", "bar", "baz", "qux"] * (N // 4))

In [119]:
categories = labels.astype("category")

In [121]:
labels.memory_usage(deep=True)

520000132

In [123]:
categories.memory_usage(deep=True)

10000512

### Categorical Methods

In [126]:
s = pd.Series(["a", "b", "c", "d"] * 2)
cat_s = s.astype("category")
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [132]:
cat_s.cat.codes # special accessor attribute cat provides access to categorical methods

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

In [134]:
cat_s.cat.categories

Index(['a', 'b', 'c', 'd'], dtype='object')

In [136]:
actual_categories = ["a", "b", "c", "d", "e"]
cat_s2 = cat_s.cat.set_categories(actual_categories)
cat_s2

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [138]:
cat_s.value_counts()

a    2
b    2
c    2
d    2
Name: count, dtype: int64

In [140]:
cat_s2.value_counts()

a    2
b    2
c    2
d    2
e    0
Name: count, dtype: int64

In [142]:
# in large datasets, categoricals are often used as a convenient tool for memory savings and better performance.

In [146]:
# after you filter a large DataFrame or Series, many of the categories may not appear in the data.
# to help with this, we can use the remove_unused_categories method to trim unobserved categories

cat_s3 = cat_s[cat_s.isin(["a", "b"])]
cat_s3

0    a
1    b
4    a
5    b
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [150]:
cat_s3.cat.remove_unused_categories()

0    a
1    b
4    a
5    b
dtype: category
Categories (2, object): ['a', 'b']

#### Creating dummy variables for modeling

In [153]:
cat_s = pd.Series(["a", "b", "c", "d"], dtype="category")

In [155]:
pd.get_dummies(cat_s)

       a      b      c      d
0   True  False  False  False
1  False   True  False  False
2  False  False   True  False
3  False  False  False   True